INSERT INTO Area (a_id, a_name) VALUES
(101, '集英樓'),
(102, '樂活小舖'),
(103, '安九'),
(104, '自十');

INSERT INTO Restaurant (r_id, r_name, a_id) VALUES
('100A', '阿關 丼飯麵咖哩', 1),
('100B', '給力盒子', 1),
('100C', '政大小吃部', 2),
('100D', '浪漫亭', 2),
('100E', '穗の葳', 2),
('100F', '幸福蛋餅', 3),
('100G', '瀚堂', 3),
('100H', '佑福鍋貼水餃麵食館', 3),
('100I', '金牌滷味', 3),
('100J', '胖子炸雞', 3),
('100K', '允浩自助餐', 3),
('100L', 'cloud 義式廚房', 3),
('100M', '異國咖啡', 4);

INSERT INTO Type (t_id, t_name) VALUES
(1001, '早餐店'),
(1002, '飲料店'),
(1003, '台式料理'),
(1004, '日式料理'),
(1005, '速食店'),
(1006, '美式料理'),
(1007, '義式料理');

INSERT INTO Restaurant_Types (r_id, t_id) VALUES
('100A', 1003),
('100A', 1004),
('100B', 1003),
('100C', 1003),
('100D', 1004),
('100E', 1004),
('100F', 1001),
('100G', 1002),
('100H', 1003),
('100I', 1003),
('100J', 1003),
('100J', 1006),
('100K', 1003),
('100L', 1003),
('100L', 1007),
('100M', 1002);


